#!/bin/bash

analyze -library WORK -format vhdl constants.vhd
echo " "
analyze -library WORK -format vhdl fd.vhd
echo " "

elaborate FD -architecture PIPPO -library WORK
echo " "
compile -exact_map
