# initial analyze and elaborate step
analyze -library WORK -format vhdl {sipisoAluControl.vhd sipisoalu.vhd}
elaborate SIPISOALU -architecture A

# initial compilation without constraints
compile

# save reports
report_timing > reports/timing_unconstrained.txt
report_power > reports/power_unconstrained.txt
report_power -cell > reports/power_unconstrained_cells_only.txt
report_power -net > reports/power_unconstrained_nets_only.txt

# now set a constraint with a clock period taken by the previous timing analysis
create_clock -name "CLK" -period 0.30 CLK
compile -map_effort high
report_power > reports/power_constrained.txt

# Here we should constrain the design's dynamic power, however 
# design vision reports that command "set_max_dynamic_power" is obsolete
# and gets ignored. Probably the version present on the server is different 
# from the one on the teachers'. The commands are present anyways.
set_max_dynamic_power 100 uW
report_power > reports/power_constrained_dyn.txt
report_timing > reports/timing_constrained_dyn.txt

# save post-synthesis netlists
write -hierarchy -format ddc -output sipisoalu-opt.ddc
write -hierarchy -format vhdl -output sipisoalu-opt.vhdl
write -hierarchy -format verilog -output sipisoalu-opt.v